/***********************************************************
               created by M.E.N
***********************************************************/

#ifndef _i7000_io_srv_h_
#define _i7000_io_srv_h_

#include <io_srv.h>
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
class I7000_IoSrv : public IoSrv
{
public:
 //I7000_IoSrv();
 //virtual ~I7000_IoSrv(); 
 virtual void Init(unsigned port,							//порт сервера
                   const char *cfg_file,      //имя файла конфигурации сервера
                   const char *dump_cfg_name, //имя конф. файла для дампа
                   const char *dump_name);    //имя файла дампа
protected:
private:
};
//----------------------------------------------------------------
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
#endif //i7000_io_srv