/********************************************************************
                 Заголовок от кп "Гранит"
                     created by M.E.N.
********************************************************************/
#ifndef _kp_header_h_
#define _kp_header_h_
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// заголовок от КП
//
struct KPHeader
{ unsigned nkp:8; //номер кп
  unsigned afb:4; //номер субблока
  unsigned mode:4;//тип пакета
  unsigned ngr:4; //номер группы
  unsigned fa:4;  //тип информации
};
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
#endif