/***********************************************************
           типы пакетов от "гранитa"
               created by M.E.N
***********************************************************/
#ifndef _kp_packets_h_
#define _kp_packets_h_

//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

#define PACKET_DATA       0x4   //пакет с данными или квитанция
#define PACKET_NO_DATA    0x9   //пакет "нет у меня данных, отвали!"
#define	PACKET_ERROR      0xA   //пакет "субблок накрылся"!
//типы пакетов с данными:
#define PACKET_TS_DATA    0x2   //пакет от субблока ТС
#define	PACKET_TIT_DATA1  0x6   //3 вида пакетов от субблока ТИТ
#define	PACKET_TIT_DATA2  0x7
#define	PACKET_TIT_DATA3  0x3
#define PACKET_TII_DATA		0x4   //пакет от субблока интегр. (ТИИ)
#define PACKET_TU_FREE		0x8   //пакет от субблока ТУ
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
#endif