/***********************************************************
               created by M.E.N
***********************************************************/

#include <I7041_types.h>
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
I7041_Dev_Dscr::I7041_Dev_Dscr()
:TypeDscr("I7041_DEV")
{
  FldDescription dscr[6]={
  {"CommDev",	  tm_string}, //имя объекта - порта
  {"Address",	  tm_byte},   //адрес на магистрали
  {"Enabled", 	tm_byte},   //разрешение работы
  {"ValidTime",	tm_uint},   //таймаут дребезга
  {"error",	    tm_byte},   //ошибка устройства
  {"etime",	    tm_time}    //время наступления ошибки
  };
  FldDscr *fld;
  for(int i=0;i<6;i++)
  {
    fld=new FldDscr(dscr[i].Name,dscr[i].Type);
    fields.push_back(fld);
  }
}
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
I7041_Dev_Dscr I7041_DEV;
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
