/**************************************************************
                    by M.E.N.
/**************************************************************/

#include <I7042_types.h>
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//контроллер ТУ I7042
I7042_Dev_Dscr::I7042_Dev_Dscr()
 :TypeDscr("I7042_DEV")
{
  FldDescription dscr[5]={
  {"CommDev",  tm_string}, //имя объекта - порта, к которому контроллер подключен
  {"Address",  tm_byte}, //Адрес на линии (0-255)
  {"Enabled",  tm_byte}, //Признак разрешения работы
  {"error",    tm_byte}, //Ошибка устройства
  {"etime",    tm_time}, //Время наступления ошибки
  };
  FldDscr *fld;
  for(int i=0;i<5;i++)
  {
    fld=new FldDscr(dscr[i].Name,dscr[i].Type);
    fields.push_back(fld);
  }
}
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
I7042_Dev_Dscr I7042_DEV;
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
