/********************************************************************
           Структура события в сервера ввода-вывода.
                     created by M.E.N.
********************************************************************/
#ifndef _io_srv_event_
#define _io_srv_event_
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
struct IoSrvEvent
{
  unsigned ev_size;	//длина сообщения (если передан массив)
  unsigned ev_id;	//идентификатор сообщения
  void *data;           //тип сообщения  
};
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
//типы сообытий - можно расширять
typedef enum{

 IO_SRV_EV_OBJS_CHANGED,	//изменение группы объеков
 IO_SRV_EV_OBJ_CHANGED,		//изменение объекта
 IO_SRV_EV_SHUTDOWN,		  //завершение работы 
 IO_SRV_EV_HALT,		      //останов
 IO_SRV_EV_SUSPEND,		    //"засыпание"
 IO_SRV_EV_RESUME		      //возобновление работы

}IO_SRV_EVENT_TYPE;
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
#endif